import re

"""Замінити перші 3 символи слів, що мають обрану довжину, на символ *"""

def get_str():
    """Отримання від користувача рядка, що складається зі слів, розділених вибраним сепаратором"""
    word_1 = input('Введіть рядок: ')
    return word_1


def get_len():
    """Отримання від користувача довжини, при якій буде виконуватись заміна"""
    num_1 = input('Оберіть довжину слова, при якій буде виконуватись заміна: ')
    if bool(re.match("^[+]?([0-9]+)$", num_1)):
        pass
    else:
        print('Ви ввели неправильний тип даних. Довжина рядка може приймати лише ціле значення. Будь ласка, спробуйте ще раз')
        get_len()
    return num_1


def main_act():
    """Виконання заміни перших 3 символів слів, довжина яких співпадає з вибраною довжиною, на *, реалізація
    багаторазового повторення циклу програми"""
    word_2 = get_str().split( )
    len_numb = get_len()
    for i in range(len(word_2)):
        if len(word_2[i]) == int(len_numb):
            word_2[i] = '***' + word_2[i][3:]
    print(word_2)
    to_exit = input("Щоб продовжити роботу з програмою, просто натисніть Y, або будь-який інший символ для завершення роботи ")
    if to_exit == "Y":
        main_act()
    else:
        print('Роботу з програмою завершено')

print('Лабораторна робота №3; Варіант №7.Завдання №1:\
 \nЗамінити перші 3 символи слів, що мають обрану довжину, на символ *')
print('Доротюк Т.В. КМ-91')
print('Ця програма здатна виконувати заміну перших 3 символів введенного слова на символи "*",\n'
      'якщо довжина введеного слова дорівнює вибраному значенню довжини.')

main_act()

