import re

"""Ця програма здатна розрахувати значення добутку, що заданий формулою"""

print('Лабораторна робота №2; Варіант №7.Завдання №2:\
 \nОрганізація циклу за допомогою оператора for')
print('Доротюк Т.В. КМ-91')
while True:
    print('Ця програма здатна розрахувати значення добутку, що заданий формулою ')
    x = input('x = ')
    n = input('n = ')
    if bool(re.match("^[+-]?([0-9]+([.][0-9]*)?|[.][0-9]+)$", x)):
        if bool(re.match("^[+]?([0-9]+)$", n)):
            pass
        else:
            print('Ви ввели неправильний тип даних. Параметр n може приймати лише цілі додатні значення')
            continue
    else:
        print('Ви ввели неправильний тип даних. Параметр х може бути лише дійсним числом')
        continue

    prod_1 = 1

    for i in range(1, int(n) + 1):
        prod_1 *= (i + float(x))
    print('Добуток становить', round(prod_1, 5))


    to_exit = input("Натисніть A, якщо бажаєте продовжити, або будь-який інший символ для завершення роботи. ")
    if to_exit == "A":
        continue
    else:
        break
print('Роботу з програмою завершено')
