import re

"""Обчислення конкретної функції, в залежності від введеного значення х"""

print('Лабораторна робота №1; Варіант №7.Завдання №3:\
 \nОбчислення конкретної функції, в залежності від введеного значення х')
print('Доротюк Т.В. КМ-91')
while True:
    print('Ця програма здатна розрахувати значення функції в залежності від змінної')
    x = input('x= ')
    if bool(re.match("^[+-]?([0-9]+([.][0-9]*)?|[.][0-9]+)$", x)):
        pass
    else:
        print('Ви ввели неправильний тип даних. Програма працює лише з числами!')
        continue

    if float(x) >= 0 and float(x) <= 3:
        res_1 = pow(float(x), 2)
    elif float(x) > 3:
        res_1 = 4
    else:
        res_1 = 4
    print('При введеному Вами х функція набуває такого значення: ' + str(res_1))

    to_exit = input("Щоб продовжити розрахунки, просто натисніть A, або будь-який інший символ для завершення роботи")
    if to_exit == "A":
        continue
    else:
        break
print('Роботу з програмою завершено')


