import re

"""Підрахувати кількість негативних серед чисел а, b, с (ввести з клавіатури)"""

print('Лабораторна робота №1; Варіант №7.Завдання №2:\
 \nПідрахувати кількість негативних серед чисел а, b, с (ввести з клавіатури).')
print('Доротюк Т.В. КМ-91')

while True:
        a = input('Введіть перше число: ')
        b = input('Введіть друге число: ')
        c = input('Введіть третє число: ')
        if bool(re.match("^[+-]?([0-9]+([.][0-9]*)?|[.][0-9]+)$", a)):
            if bool(re.match("^[+-]?([0-9]+([.][0-9]*)?|[.][0-9]+)$", b)):
                if bool(re.match("^[+-]?([0-9]+([.][0-9]*)?|[.][0-9]+)$", c)):
                    pass
                else:
                    print('Ви ввели неправильний тип даних. Програма працює лише з дійсними числами!')
                    continue
        else:
            print('Ви ввели неправильний тип даних. Програма працює лише з дійсними числами!')
            continue

        lol = [float(a), float(b), float(c)]
        negatives = 0
        for a in lol:
            negatives += ( a  < 0 )
        print('Кількість негативних чисел серед введених Вами: '+ str(negatives))

        to_exit = input("Щоб продовжити розрахунки, просто натисніть A, або будь-який інший символ для завершення роботи")
        if to_exit == "A":
            continue
        else:
            break
print('Роботу з програмою завершено')
